test-data/xml/scenario-02-mixed-id-types.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Scenario 2: Heterogeneous Workforce (NISS + BIS + Limosa)
     Tests: ID type routing, LimosaDeclaration node vs INSS node -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v1="http://socialsecurity.be/presenceregistration/v1"
                  xmlns:v11="http://socialsecurity.be/presenceregistration/schemas/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:RegisterPresencesRequest>
         <v1:PresenceRegistrationRequest>
            <v11:RegistrationDate>2026-03-16</v11:RegistrationDate>
            <v11:INSS>88041512399</v11:INSS>
            <v11:CompanyID>0412345678</v11:CompanyID>
            <v11:WorkPlaceId>W987654321</v11:WorkPlaceId>
         </v1:PresenceRegistrationRequest>
         <v1:PresenceRegistrationRequest>
            <v11:RegistrationDate>2026-03-16</v11:RegistrationDate>
            <v11:INSS>85451298733</v11:INSS>
            <v11:CompanyID>0412345678</v11:CompanyID>
            <v11:WorkPlaceId>W987654321</v11:WorkPlaceId>
         </v1:PresenceRegistrationRequest>
         <v1:PresenceRegistrationRequest>
            <v11:RegistrationDate>2026-03-16</v11:RegistrationDate>
            <v11:LimosaDeclaration>L-2026-123456</v11:LimosaDeclaration>
            <v11:CompanyID>0412345678</v11:CompanyID>
            <v11:WorkPlaceId>W987654321</v11:WorkPlaceId>
         </v1:PresenceRegistrationRequest>
      </v1:RegisterPresencesRequest>
   </soapenv:Body>
</soapenv:Envelope>
